app/controllers/prices_controller.rb

  def index
    @prices = stock.prices.find :all
---
SELECT * FROM "prices" WHERE ("prices".stock_id = 1)

  def create
    @price = stock.prices.new(params[:price])
    @price.save!
---
INSERT INTO "prices" ("high_price", "updated_at", "date", "close_price", "value", "low_price", "stock_id", "open_price", "created_at") VALUES(12.0, '2010-03-25 17:40:43', '2010-03-25', 12.0, 1234123, 10.0, 1, 10.0, '2010-03-25 17:40:43')