app/controllers/stocks_controller.rb

  def index
    @stocks = Stock.find :all
---
SELECT * FROM "stocks" WHERE ("stocks"."id" = 891568579)

  def show
    @stock = Stock.find(params[:id])
---
SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)

  def create
    @stock = Stock.new(params[:stock])
    @stock.save!
---
INSERT INTO "stocks" ("updated_at", "code", "created_at") VALUES('2010-03-18 18:51:15', 'APL', '2010-03-18 18:51:15')

  def edit
    @stock = Stock.find(params[:id])
---
SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)

  def update
    @stock = Stock.find(params[:id])
    @stock.attributes = params[:stock]
    @stock.save!
---
SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)
UPDATE "stocks" SET "code" = 'BHQ', "updated_at" = '2010-03-18 19:00:57' WHERE "id" = 1

  def destroy
    @stock = Stock.find(params[:id])
    @stock.destroy
---
SELECT * FROM "stocks" WHERE ("stocks"."id" = 4)
DELETE FROM "stocks" WHERE "id" = 4